## Simple Approaches to Recommender System

https://www.kaggle.com/datasets/uciml/restaurant-data-with-consumer-ratings

### Popularity-Based Recommenders

In [1]:
import numpy as np
import pandas as pd

In [5]:
frame = pd.read_csv("data/rating_final.csv")
cuisine = pd.read_csv("data/chefmozcuisine.csv")

In [3]:
frame.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [6]:
cuisine.head()

   placeID        Rcuisine
0   135110         Spanish
1   135109         Italian
2   135107  Latin_American
3   135106         Mexican
4   135105       Fast_Food

#### Recommending based on counts

In [10]:
frame.groupby('placeID')['rating'].count()

placeID
132560     4
132561     4
132564     4
132572    15
132583     4
          ..
135088     6
135104     7
135106    10
135108    11
135109     4
Name: rating, Length: 130, dtype: int64

In [11]:
rating_by_count = pd.DataFrame(frame.groupby('placeID')['rating'].count())
rating_by_count

         rating
placeID
132560        4
132561        4
132564        4
132572       15
132583        4
...         ...
135088        6
135104        7
135106       10
135108       11
135109        4

[130 rows x 1 columns]

In [15]:
rating_by_count.sort_values('rating', ascending=False, inplace=True)

In [16]:
rating_by_count

         rating
placeID
135085       36
132825       32
135032       28
135052       25
132834       25
...         ...
132766        3
132717        3
135011        3
132668        3
135016        3

[130 rows x 1 columns]

In [21]:
# Top 10 Cuisine
summary = pd.merge(rating_by_count, cuisine, on='placeID').head(10)
summary

   placeID  rating         Rcuisine
0   135085      36        Fast_Food
1   132825      32          Mexican
2   135032      28        Cafeteria
3   135032      28     Contemporary
4   135052      25              Bar
5   135052      25  Bar_Pub_Brewery
6   132834      25          Mexican
7   135060      22          Seafood
8   135042      20          Chinese
9   132862      18    International

In [22]:
cuisine['Rcuisine'].describe() # Mexican food is popular and that places that serve it are good candida

count         916
unique         59
top       Mexican
freq          239
Name: Rcuisine, dtype: object